# print() ბეჭდავს ეკრანზე შეტყობინებას ან მნიშვნელობას
print("გამარჯობა")

# input() მომხმარებლისგან იღებს შეტანას (ტექსტს) სტრინგის სახით
name = input("შეიყვანე შენი სახელი: ")

# int() სტრინგს ან სხვა ტიპს გარდაქმნის მთელ რიცხვად
num = int("5")

# float() გარდაქმნის მნიშვნელობას ათწილადად
num = float("3.14") 

# str() სხვა ტიპის მნიშვნელობას გარდაქმნის სტრინგად
text = str(123)

# bool() ნებისმიერ მნიშვნელობას გარდაქმნის True ან False ტიპად.
true = bool("helloworld")

# range() ქმნის რიცხვთა მიმდევრობას 
for i in range(3):  
    print(i)

# type() გამოაქვს ობიექტის ტიპი
print(type(10))

# list() გარდაქმნის ობიექტს სიად
nums = list("123") 
