# Sequence ნიშნავს, რომ კოდი სრულდება ზედიზედ, მაღლიდან დაბლა.

x = 5            # ნაბიჯი 1: ცვლადი x-ს ვანიჭებთ მნიშვნელობას 5
y = 10           # ნაბიჯი 2: ცვლადი y-ს ვანიჭებთ მნიშვნელობას 10
x+y = x + y      # ნაბიჯი 3: ვკრიბავთ x-ს (5) და y-ს (10) → შედეგად გვაქვს 15
print(x+y)       # ნაბიჯი 4: გამოაქვს 15 ეკრანზე

#Iteration ნიშნავს:
# პროცესს, როცა ერთი და იგივე კოდი მეორდება რამდენჯერმე. Python-ში iteration ძირითადად ხდება for და while ციკლებით.

#Selection - გადაწყვეტილების მიღება პირობის მიხედვით
age = 15

if age >= 18:
    print("თქვენ სრულწლოვანი ხართ")
else:
    print("თქვენ ხართ არასრულწლოვანი")
