// level 52:
// 1) ახსენი რას აკეთებს alert
// 2) ახსენი რას აკეთებს prompt
// 3) ახსენი რა განსხვავებაა alert-სა და prompt-ს შორის
// 4) გამოიტანეთ alert-ით "hello world" მესიჯი
// 5) მომხმარებელს შემოატანინე 2 რიცხვი და მოახდინე ყველა მათემატიკური ოპერაცია
// 6) მომხმარებელს შემოატანინეთ ასაკი და შეამოწმეთ სრულწლოვანია თუ არა  (გამოიტანეთ alert-ით) 
// 7)  შექმენი 2 ცვლადი, სადაც მომხმარებელს შემოატანინებ რიცხვებს. შეამოწმე რომელი რიცხვია დადებითი და რომელი უარყოფითი (გამოიტანეთ console.log()-ით) 
// 8) შექმენი 3 ცვლადი, ერთი იყოს რო მომხმარებელს უნდა შემოატანინო მათემატიკური სიმბოლო (+, -, *, /, %), დანარჩენი ორი ცვლადი უნდა იყოს რიცხვები. სიმბოლოს მიხედვით შეასრულე ამ ორ ცვლადში სადაც რიცხვები, არის შესრულდეს მოქმედება. (შედეგი გამოიტანეთ console.log-ით)


// 1) alert გვაძლევს გაფრთხილებას საიტის გახსნისას.
// 2) prompt გამოიყენება ინფორმაციის შესატანად.
// 3) alert გვაძლევს გაფრთხილებას და prompt ინმფორმაციის შესატანად არის გამოყენებული.

// 4)
alert("hello world");

// 5)
let num = Number(prompt("დაწერეთ პირველი რიცხვი"));
let num1 = Number(prompt("დაწერეთ მეორე რიცხვი"));
console.log(num1 + num);
console.log(num1 - num);
console.log(num1 / num);
console.log(num1 * num);
console.log(num1 % num);

// 6)
let age = Number(prompt("შეიყვანეთ თქვენი ასაკი"));
if (age >= 18)(
    alert("სურწლოვანი ხარ")
)
else (
    alert("სრულწლოვანი არ ხარ")
);

// 7)
let num2 = Number(prompt("დაწერეთ პირველი რიცხვი"));
let num3 = Number(prompt("დაწერეთ მეორე რიცხვი"));
if (num2 >= 0)(
    console.log(num2 + " დადებითა")
)
else (
    console.log(num2 + " უარყოფითა")
);
if (num3 >= 0)(
    console.log(num3 + " დადებითა")
)
else (
    console.log(num3 + " უარყოფითა")
);

// 8)
let a = (prompt("შემოიტანე მათემატიკური სიმბოლო (+, -, *, /, %)"));
let num4 = Number(prompt("დაწერეთ პირველი რიცხვი"));
let num5 = Number(prompt("დაწერეთ მეორე რიცხვი"));
if (a == "+")(
    console.log(num4 + num5)
)
else if (a == "-")(
    console.log(num4 - num5)
)
else if (a == "*")(
    console.log(num4 * num5)
)
else if (a == "/")(
    console.log(num4 / num5)
)
else if (a == "%")(
    console.log(num4 % num5)
)
else(
    console.log("შეცდომაა")
);